[
   {
      "bookId": "1",
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "/images/BookCover1.png",
      "review": "Harper Lee's timeless classic explores themes of racial injustice, moral growth, and compassion through the eyes of young Scout Finch. A poignant and thought-provoking narrative that remains as relevant today as ever.",
      "totalPages": 281,
      "rating": 4.8,
      "category": "Fiction",
      "tags": ["Coming of Age", "Legal Drama"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
   },
   {
      "bookId": "2",
      "bookName": "Atomic Habits",
      "author": "James Clear",
      "image": "/images/BookCover2.png",
      "review": "In 'Atomic Habits,' James Clear presents a comprehensive guide to building and maintaining habits that can lead to remarkable personal and professional growth. With actionable strategies backed by scientific research, Clear demonstrates how small changes can compound over time to produce significant results. Through engaging anecdotes and practical advice, he offers readers a roadmap for transforming their lives one habit at a time.",
      "totalPages": 320,
      "rating": 4.9,
      "category": "Self-Help",
      "tags": ["Productivity", "Personal Development"],
      "publisher": "Avery",
      "yearOfPublishing": 2018
   },
   {
      "bookId": "3",
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "/images/BookCover3.png",
      "review": "Salinger's iconic novel follows the misadventures of disillusioned teenager Holden Caulfield as he navigates the complexities of adolescence and societal expectations. A seminal work that continues to resonate with readers of all ages.",
      "totalPages": 224,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Coming of Age", "Psychological"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
   },
   {
      "bookId": "4",
      "bookName": "Rich Dad Poor Dad",
      "author": "Robert T. Kiyosaki",
      "image": "/images/BookCover4.png",
      "review": "In 'Rich Dad Poor Dad,' Robert T. Kiyosaki shares his personal story of growing up with two influential father figures — his biological father, the 'poor dad,' and the father of his childhood best friend, the 'rich dad.' Through their differing perspectives on money and investing, Kiyosaki imparts invaluable lessons on financial literacy, wealth-building, and the mindset required for success. With its straightforward narrative and practical insights, 'Rich Dad Poor Dad' continues to inspire readers to rethink their approach to money and pursue financial independence.",
      "totalPages": 336,
      "rating": 4.7,
      "category": "Personal Finance",
      "tags": ["Investing", "Wealth Management"],
      "publisher": "Plata Publishing",
      "yearOfPublishing": 1997
   },
   {
      "bookId": "5",
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "/images/BookCover5.png",
      "review": "Tolkien's enchanting tale follows the journey of Bilbo Baggins, a hobbit who embarks on an epic quest to reclaim the Lonely Mountain and its treasure from the dragon Smaug. Filled with adventure, magic, and unforgettable characters, The Hobbit is a timeless classic.",
      "totalPages": 310,
      "rating": 4.7,
      "category": "Fantasy",
      "tags": ["Adventure", "Epic"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
   },
   {
      "bookId": "6",
      "bookName": "Cracking the Coding Interview",
      "author": "Gayle Laakmann McDowell",
      "image": "/images/BookCover6.png",
      "review": "Gayle Laakmann McDowell's 'Cracking the Coding Interview' is an indispensable resource for anyone preparing for technical interviews in the software engineering industry. Packed with comprehensive coverage of algorithms, data structures, problem-solving techniques, and interview strategies, this book equips readers with the knowledge and skills needed to succeed in the competitive world of tech interviews. With its clear explanations, practice questions, and expert tips, 'Cracking the Coding Interview' remains the go-to guide for aspiring software engineers.",
      "totalPages": 708,
      "rating": 4.8,
      "category": "Programming",
      "tags": ["Technical Interview", "Algorithm"],
      "publisher": "CareerCup",
      "yearOfPublishing": 2008
   },
   {
      "bookId": "7",
      "bookName": "The Alchemist",
      "author": "Paulo Coelho",
      "image": "/images/BookCover7.png",
      "review": "Paulo Coelho's 'The Alchemist' is a timeless fable that follows the journey of Santiago, a young shepherd boy, as he embarks on a quest to fulfill his Personal Legend. Set against the backdrop of the Andalusian desert, the novel is a profound exploration of destiny, dreams, and the search for meaning. Through Santiago's encounters with wise mentors, unexpected challenges, and the mysteries of the universe, Coelho imparts powerful lessons on courage, perseverance, and the transformative power of following one's heart. With its lyrical prose and profound insights, 'The Alchemist' continues to inspire readers around the world to pursue their dreams and embrace the journey of self-discovery.",
      "totalPages": 197,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Adventure", "Philosophical"],
      "publisher": "HarperCollins",
      "yearOfPublishing": 1988
   },
   {
      "bookId": "8",
      "bookName": "The Power of Now",
      "author": "Eckhart Tolle",
      "image": "/images/BookCover8.png",
      "review": "Eckhart Tolle's 'The Power of Now' is a transformative guide to spiritual enlightenment. Through practical teachings and insights, Tolle invites readers to embrace the present moment and transcend the egoic mind. With its profound wisdom and accessible language, 'The Power of Now' offers a path to inner peace and liberation from suffering.",
      "totalPages": 236,
      "rating": 4.6,
      "category": "Spirituality",
      "tags": ["Mindfulness", "Self-help"],
      "publisher": "New World Library",
      "yearOfPublishing": 1997
   },
   {
      "bookId": "9",
      "bookName": "Harry Potter",
      "author": "J.K. Rowling",
      "image": "/images/BookCover9.png",
      "review": "J.K. Rowling's 'Harry Potter and the Philosopher's Stone' introduces readers to the magical world of Hogwarts School of Witchcraft and Wizardry. Through the adventures of Harry Potter and his friends, Rowling crafts a captivating tale of friendship, bravery, and the battle between good and evil. With its imaginative storytelling and richly drawn characters, the first book in the Harry Potter series captivates readers of all ages.",
      "totalPages": 332,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["Magic", "Adventure"],
      "publisher": "Bloomsbury",
      "yearOfPublishing": 1997
   }
]
